Тестовая_база_ERP_14/src/Catalogs/АГ_ТипРазрешенийСверхАкцепта/АГ_ТипРазрешенийСверхАкцепта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АГ_ТипРазрешенийСверхАкцепта</name>
  <attributes>
    <name>ТипРазрешений</name>
    <type>
      <types>EnumRef.АГ_ТипРазрешенийСверхАкцепта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЧисло</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/АГ_ТипРазрешенийСверхАкцепта/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура НазначитьТипПриИзменении(Элемент)
	
	Если НазначитьТип = 0 Тогда
		Объект.ТипБулево = Истина;
		Объект.ТипЧисло  = Ложь;
	ИначеЕсли НазначитьТип = 1 Тогда
		Объект.ТипБулево = Ложь;
		Объект.ТипЧисло  = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРазрешенийПриИзменении(Элемент)
	
	Объект.Наименование = Объект.ТипРазрешений;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ТипБулево Тогда
		НазначитьТип = 0;
	ИначеЕсли  Объект.ТипЧисло Тогда
		НазначитьТип = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = Объект.ТипРазрешений;
	
	Если НазначитьТип = 0 Тогда
		Объект.ТипБулево = Истина;
		Объект.ТипЧисло  = Ложь;
	ИначеЕсли НазначитьТип = 1 Тогда
		Объект.ТипБулево = Ложь;
		Объект.ТипЧисло  = Истина;
	КонецЕсли;	
	
	Если Не Отказ Тогда
		Отказ = ПроверкаНаДублиНаСервере();
		Если Отказ Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В справочнике уже есть такой элемент!";
			Сообщение.Сообщить();
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверкаНаДублиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	АГ_ТипРазрешенийСверхАкцепта.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.АГ_ТипРазрешенийСверхАкцепта КАК АГ_ТипРазрешенийСверхАкцепта
	|ГДЕ
	|	АГ_ТипРазрешенийСверхАкцепта.ТипРазрешений = &ТипРазрешений
	|	И АГ_ТипРазрешенийСверхАкцепта.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ТипРазрешений", Объект.ТипРазрешений);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И АГ_ТипРазрешенийСверхАкцепта.Ссылка <> &Ссылка","");
	Иначе	
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	    
	Если Не Результат.Пустой() Тогда
	    Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("ТипРазрешений");
	
КонецПроцедуры
